app/Controllers/news.php

INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('hihi', 'hihi', 'this it test')
---
    public function create()
    {

        $model = model(NewsModel::class);
        $request = \Config\Services::request();//?

        if ($this->request->getMethod() === 'post' && $this->validate([
            'title' => 'required|min_length[3]|max_length[255]',
            'body' => 'required',
        ])) {
            $model->save([
                'title' => $request->getPost('title'),
                'slug' => url_title($request->getPost('title'), '-', true),
                'body' => $request->getPost('body'),
            ]);